//操作符详解 - & | ^

#include<stdio.h>

//& 按二进制位与
//int main()
//{
//	
//	int a = 5;
//	int b = 3;
//	//a - 00000000000000000000000000000101 - 补码（负数要先算出补码）
//	//b - 00000000000000000000000000000011 - 补码
//	//规则：异号为0，同为1则为1
//	//c - 00000000000000000000000000000001 - 所以c为1
//	int c = a&b;
//	printf("%d\n", c);
//	return 0;
//}


////| 按二进制位或
//int main()
//{
//	int a = 5;
//	int b = 3;
//	//a - 00000000000000000000000000000101 - 补码（负数要先算出补码）
//	//b - 00000000000000000000000000000011 - 补码
//	//规则：有一个1则为1
//	//c - 00000000000000000000000000000111 - 所以c为7
//	int c = a | b;
//	printf("%d\n", c);
//	return 0;
//}



//^ 按二进制位异或
int main()
{
	int a = 5;
	int b = 3;
	//a - 00000000000000000000000000000101 - 补码（负数要先算出补码）
	//b - 00000000000000000000000000000011 - 补码
	//规则：相同为0，相异为1
	//c - 00000000000000000000000000000110 - 所以c为6
	int c = a ^ b;
	printf("%d\n", c);
	return 0;
}