//打印1000-2000年之间的“闰年”

#include <stdio.h>
//方法一：
//int main()
//{
//	int i = 0;
//	int max = 0;
//	for (i = 1000; i <= 2000; i++)
//	{
//		//判断是否为闰年
//		//1.能被4整除并且不能被100整除是闰年
//		//2.能被400整除是闰年
//		if (i % 4 == 0 && i % 100 != 0)
//		{
//			printf("%d", i);
//			max++;
//		}
//		else if (i % 400 == 0)
//		{
//			printf("%d", i);
//			max++;
//		}
//	}
//	printf("\nmax=%d年\n", max);
//	return 0;
//}

//方法二：
int main()
{
	int i = 0;
	int max = 0;
	for (i = 1000; i <= 2000;i++)
	{
		//判断是否为闰年
		//1.能被4整除并且不能被100整除是闰年
		//2.能被400整除是闰年
		if ((i%4==0) && (i%100 != 0) || (i%400 ==0))
		{
			printf("%d", i);
				max++;
		}
	}
	printf("\n一共是%d\n年", max);
	return 0;
}